cf/Reports/PlannedSalary.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Report>
		<Properties>
			<Name>PlannedSalary</Name>
		</Properties>
	</Report>
</MetaDataObject>

cf/InformationRegisters/Employees.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>Employees</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Position</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Positions</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Works</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Employee</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Reports/PlannedSalary/Ext/ObjectModule.bsl
Procedure OnComposeResult(ResultDocument, DetailsData, StandardProcessing)

	StandardProcessing = False;
	
	CompositionSettings = SettingsComposer.GetSettings();

	TemplateComposer = New DataCompositionTemplateComposer;
	CompositionTemplate = TemplateComposer.Execute(
		DataCompositionSchema,
		CompositionSettings,
		DetailsData
	);
	
	ExternalDataSets = New Structure;
	ExternalDataSets.Insert("PayrollAccrualsFromHRM", PayrollAccrualsFromHRM());
	
	CompositionProcessor = New DataCompositionProcessor;
	CompositionProcessor.Initialize(CompositionTemplate, ExternalDataSets, DetailsData, True);
	
	OutputProcessor = New DataCompositionResultSpreadsheetDocumentOutputProcessor;
	OutputProcessor.SetDocument(ResultDocument);
	
	OutputProcessor.Output(CompositionProcessor);
	
EndProcedure

Function PayrollAccrualsFromHRM()

	Result = New ValueTable;
	Result.Columns.Add("Employee", New TypeDescription("CatalogRef.Employees"));
	Result.Columns.Add("Company", New TypeDescription("CatalogRef.Companies"));
	
	NumberQualifier = New NumberQualifiers(10, 0, AllowedSign.Nonnegative);
	Result.Columns.Add("NumberOfHours", New TypeDescription("Number", NumberQualifier));
	Result.Columns.Add("CurrentSalary", New TypeDescription("Number", NumberQualifier));
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	EmployeesSliceLast.Employee AS Employee,
	|	EmployeesSliceLast.Company AS Company
	|FROM
	|	InformationRegister.Employees.SliceLast(&CurrentDate, ) AS EmployeesSliceLast
	|WHERE
	|	EmployeesSliceLast.Works";

	CurrentDate = CurrentSessionDate();

	Query.SetParameter("CurrentDate", CurrentDate);
	Selection = Query.Execute().Select();

	// Number of days during this month up to the current date multiple 8 hours per day
	NumberOfHoursCurrentMonth = Day(CurrentDate) * 8;
	
	RandomNumberGenerator = New RandomNumberGenerator;
	While Selection.Next() Do
		
		NewRow = Result.Add();
		
		FillPropertyValues(NewRow, Selection);
		NewRow.NumberOfHours = RandomNumberGenerator.RandomNumber(1, NumberOfHoursCurrentMonth);
		NewRow.CurrentSalary = NewRow.NumberOfHours * 500;
		
	EndDo;
	
	Return Result;

EndFunction
